
#include <stdio.h>
//枚举法
//1.白钱买百鸡
int main()
{
	for(int i = 0; i < 20; i++)
	{	
		for(int j = 1; j < 33; j++)
			{
				int z = 100 - i - j;
				if(5*i + 3*j + z/3.0 == 100) //除数是浮点数，结果也是浮点数 ->细节！！
					printf("%d %d %d\n", i, j, z);
			}	
	}	
	return 0;
}
//2.数字谜
//int main(int argc, char *argv[]) 
//{
//	int A, B, C, D;
//	long E, F;
//	for(int A = 3; A <= 9; A++)
//		{
//			for(int D = 1; D <=9; D++)
//				{
//					E = D*100000 + D*10000 + D*1000 + D*100 + D*10 + D; //E来存储结果
//					if(E % A == 0) //E 可以被 A 整除
//					{
//						F = E/A; // F为 乘数1
//						if((F/10000) == A && (F/10)%10 == A)
//							{
//								if(F%10 == F/1000%10)
//									printf("%ld*%d=%ld\n", F, A, E);
//							}
//					}
//				}
//			
//		}
//	
//	
//	
//	return 0;
//}

//3.求三个数的最小公倍数
//int main(int argc, char *argv[]) {
//	int a, s, d;
//	scanf("%d %d %d", &a, &s, &d);
//	for(int i = 1; i <1000000; i++)
//		{
//			if(i%a==0 && i%s==0  && i%d==0)
//				{
//					printf("%d,%d,和%d的最小公倍数是%d\n", a, s, d, i);
//					break;
//				}
//		}
//}

//4.韩信点兵
//int main(int argc, char *argv[]) {
//	for(int i = 11; i <= 10000; i++)
//		{	//注意标准用法和简略版？？
//			if((i-1)%5==0 && (i-5)%6==0 && (i-5)%7==0 && (i-10)%11==0 && (i-11)%13==0)
//				printf("士兵最少有%d个\n", i);
//		}
//	
//}
//
//5.逻辑判断问题（枚举法 + 判断条件）！！
/*
本关任务：正确输出他们各自所戴帽子的颜色。
厅内有 5 个人，他们均戴着帽子，有白帽子和红帽子。 （两种帽子1 / 0）
已知戴白帽子的说真话，戴红帽子的说假话，请从他们各自提供的线索辨别谁戴白帽子，谁戴红帽子。
甲：我看见一个戴白帽子的
乙：我没有看见戴红帽子的
丙：我看见一个戴白帽子的，但不是甲
丁：我没有看见戴白帽子的
戊：我的帽子和丙一样
*/
//int main(int argc, char *argv[])
//{	
//	int c1, c2, c3, c4, c5;
//	for(int a = 0; a <= 1; a++) //0、1同时代表说真假话or戴红、白帽子
//		for(int b = 0; b <= 1; b++)
//			for(int c = 0; c <= 1; c++)
//				for(int d = 0; d <= 1; d++)
//					for(int e = 0; e <= 1; e++)
//					{
//						c1 = ((b+c+d+e)==1)==a; //c1为当前枚举的情况 正确与否
//						c2 = ((a+c+d+e)==4)==b;
//						c3 = ((b+d+e)==1)==c;
//						c4 = ((a+b+c+d)==0)==d;
//						c5 = ((c==e))==e;
//						if(c1 && c2 && c3 && c4 && c5)
//							{
//								if(a==1)
//									printf("甲戴白帽子\n");
//								else
//									printf("甲带红帽子\n");
//								if(b==1)
//									printf("乙戴白帽子\n");
//								else
//									printf("乙带红帽子\n");
//								if(c==1)
//									printf("丙戴白帽子\n");
//								else
//									printf("丙带红帽子\n");
//								if(d==1)
//									printf("丁戴白帽子\n");
//								else
//									printf("丁带红帽子\n");	
//								if(e==1)
//									printf("戊戴白帽子\n");
//								else
//									printf("戊带红帽子\n");
//							}
//					}
//	
//	//	int a = 1;
//	//	printf("%d\n", a==3); //直等号会进行判断（0/1）[编程思维！]
//	return 0;
//}